project1-resources/run-grid-coarse-KVLCC2-SA/system/blockMeshDict-no-sym
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

convertToMeters 1;

vertices  
(
  (-3.0 -3.0  -3.0)
  (12.0 -3.0  -3.0)
  (12.0  3.0  -3.0)
  (-3.0  3.0  -3.0)

  (-3.0 -3.0 0.0)
  (12.0 -3.0 0.0)
  (12.0  3.0 0.0)
  (-3.0  3.0 0.0)
);

blocks  
(
    hex ( 0 1 2 3 4 5 6 7) (60 24 12) simpleGrading (1 1 1)
);

edges  
(
);

patches  
( 

  patch inlet
  (
      (0 4 7 3)
  ) 
  patch outlet
  (
      (1 2 6 5)
  ) 
  patch back
  (
      (0 1 5 4)
  ) 
  patch front
  (
      (3 7 6 2)
  ) 
  symmetry bot
  (
      (0 3 2 1)
  ) 
  patch top
  (
      (4 5 6 7)
  )
);

mergePatchPairs  
(
);
