project1-resources/run-grid-coarse-KVLCC2-SA/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes 
{
    default steadyState;
}

gradSchemes
{
    default Gauss linear;
    grad(U) cellLimited Gauss linear 1.0;
    grad(nuTilda) cellLimited Gauss linear 1.0;
}

divSchemes
{
    default                       none;
    div(phi,U)                    bounded Gauss linearUpwindV grad(U);
    div(phi,nuTilda)              bounded Gauss upwind;
    div(phi,k)                    bounded Gauss upwind;
    div(phi,omega)                bounded Gauss upwind;
    div(phi,epsilon)              bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

interpolationSchemes
{
    default linear;
}

laplacianSchemes
{
    default Gauss linear limited corrected 0.333;
}

snGradSchemes
{
    default limited corrected 0.333;
}

fluxRequired
{
    default no;
    p;
}
wallDist
{
    method meshWave;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
